The  PerformanceAdviserRuleId  type exposes the following members.
 Operators
Name  |   Description
Equality
 Compares two PerformanceAdviserRuleId instances.
Inequality
 Compares two PerformanceAdviserRuleId instances.
 See Also
  PerformanceAdviserRuleId Class
  Autodesk.Revit.DB Namespace